import numpy as np;

# [0,0] - промисловість на промисловість
# [0,1] - промисловість на господарство
# [1,0] - господарство на промисловість
# [1,1] - господарство на господарство
X = np.array([
    [520, 300],
    [250, 70]
])

# [0] - попит на промисловість
# [1] - попит на промисловість
C = np.array([
    1000,
    700
])

# [0] - повний валовий випуск промисловості 
# [1] - повний валовий випуск господарства  
fullX = np.sum(X, axis=1) + C

print('Gross output:')
print(fullX)

# Прогнозовані значення на наступний рік
newC = np.array([
    1300,
    950
])

# Знаходимо технологічну матрицю A(a[i,j]=X[i,j]/fullX[j])
A = X / fullX[:, np.newaxis]

# Далі знаходимо нові повні валові випуски, що задовільнять прогнозований попит на наступний рік
# Знаходиться наступним чином: newFullX = (E-A)^(-1)*newC

E = np.eye(A.shape[0])

EA_inv = np.linalg.inv(E - A)

newFullX = np.dot(EA_inv, newC)
print('Gross output for the next year:')
print(newFullX)
